const bankCode = {
  '002': 'ธนาคารกรุงเทพ',
  '004': 'ธนาคารกสิกรไทย',
  '006': 'ธนาคารกรุงไทย',
  '009': 'ธนาคารโอเวอร์ซี-ไชนีสแบงกิ้งคอร์ปอเรชั่น',
  '011': 'ธนาคารทหารไทยธนชาต',
  '014': 'ธนาคารไทยพาณิชย์',
  '018': 'ธนาคารซูมิโตโม มิตซุย แบงกิ้ง คอร์ปอเรชั่น',
  '020': 'ธนาคารสแตนดาร์ดชาร์เตอร์ด',
  '022': 'ธนาคารซีไอเอ็มบี',
  '024': 'ธนาคารยูโอบี',
  '025': 'ธนาคารกรุงศรีอยุธยา',
  '030': 'ธนาคารออมสิน',
  '031': 'ธนาคารฮ่องกง',
  '032': 'ธนาคารดอยซ์แบงก์',
  '033': 'ธนาคารอาคารสงเคราะห์',
  '034': 'ธนาคารเพื่อการเกษตร',
  '039': 'ธนาคารมิซูโฮ',
  '045': 'ธนาคารบีเอ็นพี พารีบาส',
  '052': 'ธนาคารแห่งประเทศจีน',
  '066': 'ธนาคารอิสลาม',
  '067': 'ธนาคารทิสโก้',
  '069': 'ธนาคารเกียรตินาคิน',
  '070': 'ธนาคารไอซีบีซี',
  '071': 'ธนาคารไทยเครดิต',
  '073': 'ธนาคารแลนด์ แอนด์ เฮ้าส',
  '098': 'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย'
};

const getNameFromBankCode = (code) => {
  return bankCode[code];
};

export default getNameFromBankCode;
